<a href="https://colab.research.google.com/github/noushadkhan01/Projects/blob/master/Kaggle%20Competitions/Titanic%20Survival/By_simple_logistic_Regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
!ls

kaggle_competitions  kaggle.json  sample_data  sample_submission.csv

In [5]:
%cd ./kaggle_competitions

/content/kaggle_competitions

In [0]:
!mkdir Titanic_survival

In [7]:
%cd Titanic_survival

/content/kaggle_competitions/Titanic_survival

In [9]:
!kaggle competitions download -c titanic

Downloading train.csv to /content/kaggle_competitions/Titanic_survival
  0% 0.00/59.8k [00:00<?, ?B/s]
100% 59.8k/59.8k [00:00<00:00, 25.0MB/s]
Downloading test.csv to /content/kaggle_competitions/Titanic_survival
  0% 0.00/28.0k [00:00<?, ?B/s]
100% 28.0k/28.0k [00:00<00:00, 20.7MB/s]
Downloading gender_submission.csv to /content/kaggle_competitions/Titanic_survival
  0% 0.00/3.18k [00:00<?, ?B/s]
100% 3.18k/3.18k [00:00<00:00, 2.67MB/s]

In [10]:
!ls

gender_submission.csv  test.csv  train.csv

In [11]:
train = pd.read_csv('train.csv')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
test = pd.read_csv('test.csv')
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# EDA

In [14]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [15]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [16]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [17]:
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [18]:
train.skew()

PassengerId    0.000000
Survived       0.478523
Pclass        -0.630548
Age            0.389108
SibSp          3.695352
Parch          2.749117
Fare           4.787317
dtype: float64

In [19]:
test.skew()

PassengerId    0.000000
Pclass        -0.534170
Age            0.457361
SibSp          4.168337
Parch          4.654462
Fare           3.687213
dtype: float64

In [30]:
df = pd.concat([train.drop('Survived', 1), test], axis = 0)
df.shape

(1309, 11)

In [31]:
df.skew()

PassengerId    0.000000
Pclass        -0.598647
Age            0.407675
SibSp          3.844220
Parch          3.669078
Fare           4.367709
dtype: float64

In [32]:
train.Age.mean(), test.Age.mean(), df.Age.mean()

(29.69911764705882, 30.272590361445783, 29.881137667304014)

In [0]:
train.Age.fillna(df.Age.mean(), inplace = True)
test.Age.fillna(df.Age.mean(), inplace = True)

In [34]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [35]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [37]:
train.drop(['Cabin', 'Embarked'], 1, inplace = True)
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
dtype: int64

In [38]:
test.drop(['Cabin', 'Embarked'], 1, inplace = True)
test.isnull().sum().sort_values(ascending = False)[:2]

Fare      1
Ticket    0
dtype: int64

In [39]:
test.Fare.fillna(df.Fare.mean(), inplace = True)
sum(test.isnull().sum())

0

In [0]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

In [0]:
X = train.drop(['Survived', 'PassengerId', 'Name', 'Ticket'], 1)
y = train.Survived

In [0]:
X.Sex.replace(['male', 'female'], [1, 0], inplace = True)

In [51]:
X.head(2)

   Pclass  Sex   Age  SibSp  Parch     Fare
0       3    1  22.0      1      0   7.2500
1       1    0  38.0      1      0  71.2833

In [52]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.3 , random_state = 0)
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((623, 6), (268, 6), (623,), (268,))

In [53]:
X_train.head(2)

     Pclass  Sex   Age  SibSp  Parch     Fare
857       1    1  51.0      0      0  26.5500
52        1    0  49.0      1      0  76.7292

In [54]:
model = LogisticRegression().fit(X_train, y_train)
model.score(X_test, y_test)

0.7910447761194029

In [0]:
from sklearn.metrics import classification_report, confusion_matrix, precision_score, recall_score

In [0]:
y_predicted = model.predict(X_test)

In [57]:
confusion_matrix(y_test, y_predicted)

array([[144,  24],
       [ 32,  68]])

In [58]:
print(classification_report(y_test, y_predicted))

             precision    recall  f1-score   support

          0       0.82      0.86      0.84       168
          1       0.74      0.68      0.71       100

avg / total       0.79      0.79      0.79       268